      ******************************************************************
      *AUTHOR: KATH
      *DATE:04-04-2023
      *PURPOUSE:Curso Cobol N1-v22 Clase 1
      *EXTENSIÓN: cbl
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HOLA-MUNDO.
       AUTHOR. KATH.
       INSTALLATION. WWWW.
       DATE-WRITTEN. 4/4/2023.
       DATE-COMPILED. 12/4/2023.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "Hola-Mundo!"
           STOP RUN.
       END PROGRAM HOLA-MUNDO.
